snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт_А/СтатусыКМ_Факт_А.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт_А</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт_А/ManagerModule.bsl
Функция СформироватьДвижения(Регистратор) Экспорт
	Если НЕ Метаданные.РегистрыСведений.СтатусыКМ_Факт_А.СтандартныеРеквизиты.Регистратор.Тип.СодержитТип(ТипЗнч(Регистратор)) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Период,
	|	Регистратор,
	|	ТипШК,
	|	ШтрихКодУпаковки,
	|	Статус,
	|	Местонахождение,
	|	ВПути,
	|	ШтрихКодУпаковки.СпособВводаВОборот КАК СпособВводаВОборот,
	|	ШтрихКодУпаковки.ТипУпаковки 		КАК ТипУпаковки
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
	|ГДЕ
	|	Регистратор = &Регистратор
	|	И ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	НЗ = РегистрыСведений.СтатусыКМ_Факт_А.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор, Истина);
	
	НЗ.Загрузить(Запрос.Выполнить().Выгрузить());
	
	НЗ.Записать();	
КонецФункции //СформироватьДвижения(Регистратор) Экспорт

Функция ОчиститьДвижения(ДокСсылка) Экспорт
	НЗ = РегистрыСведений.СтатусыКМ_Факт_А.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ДокСсылка, Истина);
	
	Если ЗначениеЗаполнено(НЗ.Отбор.Регистратор.Значение) Тогда
		НЗ.Записать();			
	КонецЕсли;
КонецФункции //ОчиститьДвижения(ДокСсылка) Экспорт

Функция ЗаблокироватьТаблицу(тДвижений) Экспорт   
	Если ПроведениеС.УправляемыйРежим() Тогда //Ратманов
	Блокировка 			= Новый БлокировкаДанных;
	
	ЭлементБлокировки	= Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт_А");
	ЭлементБлокировки.Режим 			= РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных 	= тДвижений.Выгрузить();
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихкодУпаковки", 	"ШтрихКодУпаковки");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СпособВводаВОборот", 	"СпособВводаВОборот");
	
	Блокировка.Заблокировать();       
	КонецЕсли;
КонецФункции //ЗаблокироватьТаблицу(тДвижений) Экспорт

Функция ЗаблокироватьТаблицуДляПолученияКМ(Знач ТипШК = Неопределено) Экспорт  
	Блокировка				= Новый БлокировкаДанных;					
					
	ЭлементБлокировки 		= Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт_А");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;	
	
	Если ЗначениеЗаполнено(ТипШК) Тогда
		ЭлементБлокировки.УстановитьЗначение("ТипШК", ТипШК); 		
	КонецЕсли;	
	
	Блокировка.Заблокировать();	
КонецФункции //ЗаблокироватьТаблицуДляПолученияКМ() Экспорт

Функция УстановитьСтатусКМ(МассивКМ, Статус, Регистратор, ДопПараметры = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(Регистратор) Тогда Возврат Ложь КонецЕсли; 
	
	Если ТипЗнч(МассивКМ) = Тип("Массив") Тогда
		Коды = МассивКМ;		
	Иначе
		Коды = Новый Массив;		
		Коды.Добавить(МассивКМ);
	КонецЕсли;
	
	Местонахождение = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Местонахождение", ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла());
	ВПути 			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВПути", 	Ложь);
	Добавлять		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Добавлять", Ложь);
	
	НЗ = РегистрыСведений.СтатусыКМ_Факт_А.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор, Истина);
	
	Период = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Период");
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период = ПолучитьРеквизитШапки(Регистратор, "Дата");	
	КонецЕсли; 
	
	Для каждого ДанныеШК Из ПолучитьДанныеКМ(Коды) Цикл
		Запись = НЗ.Добавить();
		
		Запись.Период 			= Период;
		
		Запись.ШтрихКодУпаковки		= ДанныеШК.ШтрихКодУпаковки;
		//+++Чирков 01.12.2025 ТипУпаковки - убираем
		//Запись.ТипУпаковки		= ДанныеШК.ТипУпаковки;
		//---Чирков 01.12.2025
		Запись.ТипШК				= ДанныеШК.ТипШК;
		Запись.СпособВводаВОборот	= ДанныеШК.СпособВводаВОборот;
		
		Запись.Статус 			= Статус;
		Запись.Местонахождение 	= Местонахождение;
		Запись.ВПути			= ВПути;		
	КонецЦикла; 
	
	НачатьТранзакцию();
	
	Попытка
		УстановитьБлокировкуПоНаборуЗаписей(НЗ);	
	Исключение       
		ОтменитьТранзакцию();
		ЗаписатьВЛог("Отладка", "Ошибка блокировки таблицы РегистрСведений.СтатусыКМ_Факт_А. Регистратор: " + Регистратор, "Ошибка");
		Возврат Ложь;
	КонецПопытки;		
	
	Попытка
		Если Добавлять Тогда
			НЗ.Записать(Ложь);
		Иначе		
			НЗ.Записать(Истина);
		КонецЕсли;
	Исключение
		ОтменитьТранзакцию();
		ЗаписатьВЛог("Отладка", "Ошибка записи РегистрСведений.СтатусыКМ_Факт_А. Регистратор: " + Регистратор, "Ошибка");
		Возврат Ложь;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();		
	
	Возврат Истина;
КонецФункции //УстановитьСтатусКМ(МассивКМ, Регистратор, ДопПараметры = Неопределено)

Функция ПолучитьДанныеКМ(МассивКМ)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	Ссылка		КАК ШтрихКодУпаковки,
	|	ТипШК,
	|	ТипУпаковки,
	|	СпособВводаВОборот,	
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура
	|	
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	Ссылка В (&МассивКМ)
	|	И ТипКода	= ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|";		
	
	Запрос.УстановитьПараметр("МассивКМ", МассивКМ);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьДанныеКМ(МассивКМ)

Функция УстановитьБлокировкуПоНаборуЗаписей(НаборЗаписей) Экспорт
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки 		= Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт_А");
	ЭлементБлокировки.Режим 			= РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.ИсточникДанных 	= НаборЗаписей.Выгрузить();
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");	
	
	Блокировка.Заблокировать();	
КонецФункции //УстановитьБлокировкуПоНаборуЗаписей(НаборЗаписей) Экспорт
